app/controllers/books_controller.rb

INSERT INTO "books" ("author", "created_at", "description", "name", "title", "translator", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "books" SET "updated_at" = '2012-05-19 17:54:57.741096', "description" = 'Notes\ on Sea & Shore is among the finest artistic achievements of the late Greta Wrolstad.\ This sequential poem is a deep, stirring meditation that moves freely between\ internal and external landscapes. The voice in this work sings from a world\ in flux, and it does so with a rare, lyrical mastery. This long-awaited volume\ marks the first publication of Wrolstad''s poetry in book form.', "aboutAuthor" = 'Greta Wrolstad (1981-2005) was born and raised\ in Corvallis, Oregon. She died from injuries sustained in a car accident. Wrolstad\ graduated from the Robert D. Clark Honors College at the University of Oregon\ and attended the University of Montana''s Creative Writing Program, where she\ served as the poetry editor of CutBank. Among her honors are inclusion in Best\ New Poets 2007, a scholarship from Fence Books to attend the Summer Literary\ Seminars in St. Petersburg, Russia, and a 2008 Pushcart Prize for "Flickers\ of Light Become the Movement of Thousands." Her poems have appeared in The\ Canary, Black Warrior Review, A Public Space, Octopus Magazine, and CutBank.\ In her honor, the University of Montana offers the GRETA WROLSTAD TRAVEL AWARD,\ and the Summer Literary Seminars offers the GRETA WROLSTAD SCHOLARSHIP FOR YOUNG\ POETS, an annual award given to a female poet under the age of thirty to attend\ the Summer Literary Seminars in St. Petersburg.' WHERE "books"."id" = 5
---
  def update
    @book = Book.find(params[:id])

    respond_to do |format|
      if @book.update_attributes(params[:book])